  # language: ru
  @listing
  Функция: Создание объявлений

  Предыстория:
  Дано Пользователь зарегистрирован в системе через API

  Сценарий: Успешное создание объявления
  Дано Пользователь находится на главной странице
  И Пользователь авторизуется под созданным аккаунтом
  Когда Пользователь нажимает кнопку размещения объявления
  И Вводит название объявления
  И Нажимает кнопку публикации
  Тогда Объявление успешно отображается в поиске на главной странице
  И Удаляет созданное объявление через API